Catalogs/ВыделенныеIP_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВыделенныеIP_ат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СетевыеИнтерфейсы_ат</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеIP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>mask</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальнаяСеть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВиртуальныеСети_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Белый</Name>
					<Comment>Это адрес, по которому можно постучаться на сервер из внешней сети (из интернета), Контроль правильности не ведется!</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чужой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВыделенныеIP_ат/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ВиртуальнаяСеть) Тогда 
		Элементы.ВиртуальнаяСеть.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Владелец) Тогда 
		Элементы.Владелец.Доступность = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("Сервер") И ЗначениеЗаполнено(Параметры.Сервер) Тогда
		
		Сервер = Параметры.Сервер;
		
	КонецЕсли;
	ПроверкаОтображения();
КонецПроцедуры

&НаКлиенте
Процедура IPПриИзменении(Элемент)
	
	ФормированиеНаименования();
	
КонецПроцедуры


Процедура ФормированиеНаименования()
	
	Объект.Наименование = Строка(Объект.IP) +"_" + Строка(Объект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ВладелецПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ВладелецПриИзмененииНаСервере()

	Объект.ВиртуальнаяСеть = Объект.Владелец.ВиртуальнаяСеть;
	ФормированиеНаименования();

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.IP = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло(ТекущийОбъект.ПредставлениеIP);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаОтображения()
	
	Элементы.Сервер.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Сервер) Тогда
		Элементы.Сервер.Видимость = истина;
	КонецЕсли;
	
КонецПроцедуры
